CSI API ETABS v1
cFrameObj.GetSectionNonPrismatic Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSectionNonPrismatic(
	string Name,
	ref string PropName,
	ref double SVarTotalLength,
	ref double SVarRelStartLoc
)
Function GetSectionNonPrismatic (
	Name As String,
	ByRef PropName As String,
	ByRef SVarTotalLength As Double,
	ByRef SVarRelStartLoc As Double
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim PropName As String
Dim SVarTotalLength As Double
Dim SVarRelStartLoc As Double
Dim returnValue As Integer
returnValue = instance.GetSectionNonPrismatic(Name,
	PropName, SVarTotalLength, SVarRelStartLoc)
int GetSectionNonPrismatic(
	String^ Name,
	String^% PropName,
	double% SVarTotalLength,
	double% SVarRelStartLoc
)
abstract GetSectionNonPrismatic :
        Name : string *
        PropName : string byref *
        SVarTotalLength : float byref *
        SVarRelStartLoc : float byref -> int
Parameters
Name
Type: System.String
PropName
Type: System.String
SVarTotalLength
Type: System.Double
SVarRelStartLoc
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace